{
    "recipes": [
      {
        "id": 1,
        "name": " Salmon with Brown Sugar Glaze ",
        "image": "https://www.allrecipes.com/thmb/0drMpb7MzJqx-2gUUagKghEpi4M=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1119391-4451f8a551454da89ceca7466596f0d4.jpg ",
        "ingredients": "Cooking spray, 4(6 Ounce) boneless salmon fillets, salt and ground black pepper to taste, ¼ cup packed light brown sugar, and 2 tablespoons of Dijon Mustard. ",
        "instructions": "Preheat the oven broiler and set an oven rack about 6 inches from the heat source. Grease the rack of a broiler pan with cooking spray. Season salmon with salt and pepper, then place on the prepared broiler pan. Whisk together brown sugar and mustard in a small bowl; spoon mixture evenly over salmon. Cook under the preheated broiler until fish flakes easily with a fork, 10 to 15 minutes.",
        "favorite": true
      },
      {
        "id": 2,
        "name": "Yummy Pork Chops ",
        "image": "https://www.allrecipes.com/thmb/O0yg0m3hpiycUXSIEaHdcDtr_uU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7935392-a575c7e84bf34972a83b6a2ecaca0448.jpg ",
        "ingredients": "2 cups Italian-style salad dressing, ¼ cup soy sauce, ½ teaspoon pepper, and 4 boneless pork chops ",
        "instructions": "In a bowl, mix the Italian-style salad dressing, soy sauce, and pepper. Place the pork chops in a skillet over medium heat, and cover with the dressing mixture. Cover skillet, and cook pork chops 25 minutes, turning occasionally. Remove cover, reduce heat to low, and continue cooking to desired doneness.",
        "favorite": true
      },
      {
        "id": 3,
        "name": "Roasted Cauliflower Steaks",
        "image": "https://www.allrecipes.com/thmb/8wXj1OpGjIBD7RmutjGhTPR5lRU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Roasted-Cauliflower-Steaks-by-Rock_lobster-2000-3145a636596f4e72b86cf2d89aee1289.jpg",
        "ingredients": "1 head cauliflower, trimmed, 2 tablespoons extra-virgin olive oil, or more to taste, ¼ teaspoon garlic powder, or to taste (Optional), and salt and ground black pepper to taste",
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil. Place the cauliflower onto a cutting board with the stem side facing upwards; cut vertically into 4 steaks approximately even in thickness. Arrange 'steaks' onto the prepared baking sheet. Drizzle olive oil over the steaks; season with garlic powder, salt, and black pepper. Roast in preheated oven for 20 minutes, turn with a spatula, and continue to roast until soft in the middle and darkening around the edges, about 15 minutes more.",
        "favorite": false
      },
      {
        "id": 4,
        "name": " Three-Ingredient Baked Chicken Breasts ",
        "image": "https://www.allrecipes.com/thmb/3bpOHgCnhxSvX9m5RUlF2uwZL90=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/2267790-three-ingredient-baked-chicken-breasts-naples34102-1x1-1-016207151c2d47bd926ffa56d11dc6ef.jpg",
        "ingredients": "¼ cup butter melted, 1 teaspoon salt, 4 skinless and boneless chicken breast halves",
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly butter a baking dish. Stir together melted butter and salt in a bowl. Arrange chicken in the prepared baking dish. Brush butter mixture onto chicken until thoroughly coated, pouring any extra over chicken. Bake in the preheated oven until no longer pink in the center and juices run clear, 30 to 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees Fahrenheit",
        "favorite": true
      },
      {
        "id": 5,
        "name": "Turkey Burgers ",
        "image": "https://www.allrecipes.com/thmb/vZTImul92n7RRkv7Sa5JuejMPv0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/697161-d1f5222182b44badb30b88efa4eb8f81.jpg ",
        "ingredients": "1 pound ground turkey, 1 packet dry onion soup mix, ½ cup water, ½ teaspoon salt, and ½ teaspoon ground black pepper.",
        "instructions": "Preheat a grill for high heat. In a large bowl, combine the ground turkey, soup mix, and water. Season with salt and pepper. Mix lightly using your hands, and form into 4 patties. Lightly oil the grill grate. Grill patties 5 to 10 minutes per side, until well done.",
        "favorite": true
      }
    ]
  }